[
  {
  "quest":"Who was given Caleb’s daughter to marry?",
  "ans": "Othniel"
},
{
  "quest":"With how many chariots did Sisera oppress the Israelites?",
  "ans": "900"
},
{
  "quest":"What lady judged Israel?",
  "ans": "Deborah"
},
{
  "quest":"What did Deborah and Barak do after the victory?",
  "ans": "They sang praise to the Lord"
},
{
  "quest":"What did the angel of the LORD say to Meroz? ",
  "ans": "Curse Meroz"
},
{
  "quest":"What did the Midianites do to Israel?",
  "ans": "They destroyed the increase of the earth, and left no sustenance for Israel."
},
{
  "quest":"Where did the angel of the LORD appear to Gideon?",
  "ans": "By the wine press  where Gideon threshed wheat"
},
{
  "quest":"What did the angel say to Gideon?",
  "ans": "The LORD is with you, you mighty man of valor."
},
{
  "quest":"What did Gideon ask the angel? ",
  "ans": "If the LORD be with us, why then is all this befallen us? and where be all his miracles which our fathers told us of?"
},
{
  "quest":"What was the first sign that God gave to Gideon?",
  "ans": "Fire out of the rock that consumed the flesh and the unleavened cakes."
},
{
  "quest":"What two signs did God give Gideon with the fleece of wool?",
  "ans": "One day the fleece of wool was wet and the ground dry. The next day the fleece was dry and the ground was wet."
},
{
  "quest":"How many men left Gideon because they were afraid?",
  "ans": "22,000"
},
{
  "quest":"How many passed the water test?",
  "ans": "300"
},
{
  "quest":"With what were Gideon’s men equipped?",
  "ans": "Each had a trumpet, an empty pitcher and a lamp inside the pitcher"
},
{
  "quest":"What did Gideon do to the men of Succoth?",
  "ans": "Taught them with thorns of the wilderness and briers"
},
{
  "quest":"What mistake did Gideon make?",
  "ans": "He made an ephod of the gold they took as spoils, and put it in his city, even in Ophrah: and the thing became a snare to Gideon, and to his house."
},
{
  "quest":"How long did the land enjoy peace during Gideon’s lifetime?",
  "ans": "Forty years"
},
{
  "quest":"Who led Israel for twenty-three years?",
  "ans": "Tola"
},
{
  "quest":"Who led Israel for twenty-two years, and had thirty sons?",
  "ans": "Jair"
},
{
  "quest":"How many of Jerubaal’s (Gideon) sons did Abimelech slay?",
  "ans": "Seventy"
},
{
  "quest":"Who did the elders of Gilead ask to lead them in war against the Ammonites?",
  "ans": "Jephthah"
},
{
  "quest":"What did the angel of the LORD say to Manoah’s wife regarding the son that was to be born of her?",
  "ans": "No razor shall come on his head: for the child shall be a Nazarite to God from the womb"
},
{
  "quest":"What did Manoah’s wife name her son?",
  "ans": "Samson"
},
{
  "quest":"Who did Samson want for a wife?",
  "ans": "A woman in Timnath of the daughters of the Philistines"
},
{
  "quest":"What did Samson kill with his bare hands?",
  "ans": "A young lion"
},
{
  "quest":"How did Samson get the thirty changes of garments?",
  "ans": "He killed thirty men of Ashkelon and took their clothes"
},
{
  "quest":"What happened to Samson’s wife?",
  "ans": "She was given to his companion, whom he had  used as his friend"
},
{
  "quest":"What did Samson do with the foxes?",
  "ans": "He caught three hundred foxes, turned them tail to tail, and put a firebrand in the middle between two tails. When he had set the brands on fire, he let them go into the standing corn of the Philistines."
},
{
  "quest":"What did Samson do with the jawbone?",
  "ans": "Slew a thousand Philistines"
},
{
  "quest":"How long did Samson judge Israel?",
  "ans": "Twenty years"
},
{
  "quest":"Where did Samson take the doors of the city of Gaza?",
  "ans": "To the top of an hill that is before Hebron"
},
{
  "quest":"Who was offered money to determine the secret of Samson’s strength?",
  "ans": "Delilah"
},
{
  "quest":"What was the secret of Samson’s strength?",
  "ans": "His consecration to God as a Nazarite, having never cut his hair"
},
{
  "quest":"What did the Philistines do to Samson?",
  "ans": "Took him, put out his eyes, and brought him to Gaza, bound him with fetters of brass; and made him grind in the prison house"
},
{
  "quest":"How did Samson die?",
  "ans": "He pulled down the pillars of a great building where 3000 Philistines were celebrating their victory over him. The collapsing building killed both him and the Philistines."
},
{
  "quest":"What did Micah and his mother have made?",
  "ans": "A graven image and a molten image"
},
{
  "quest":"What was said about Israel in those days?",
  "ans": "There was no king in Israel, but every man did that which was right in his own eyes"
},
{
  "quest":"Who did Micah hire?",
  "ans": "A young man out of Bethlehemjudah of the family of Judah, who was a Levite"
},
{
  "quest":"What did the men of Dan take from Micah?",
  "ans": "The carved image, the ephod, the teraphim, the molten image and his priest."
},
{
  "quest":"What did the Israelites rename the city of Laish when they rebuilt it?",
  "ans": "Dan"
},

{
  "quest":"What did the wicked men of Gibeah do to the Levite’s concubine?",
  "ans": "They knew her, and abused her all the night until the morning and she died"
},
{
  "quest":"What did the Levite do with his dead concubine?",
  "ans": "He divided her with a knife, together with her bones, into twelve pieces, and sent her into all the coasts of Israel"
},
{
  "quest":"What did the Israelites ask the men of Benjamin to do?",
  "ans": "Deliver the men, the children of Belial, which were in Gibeah, in order to put them to death, and put away evil from Israel"
},
{
  "quest":"How many of the men of Benjamin fell?",
  "ans": "About twenty-five thousand"
},
{
  "quest":"How many young women of Jabesh-Gilead were available to be wives for the remaining Benjamites?",
  "ans": "400"
},
{
  "quest":"How did the rest of the Benjamites obtain their wives?",
  "ans": "They caught a girl of the daughters of Shiloh who was dancing at the yearly feast."
},
{
  "quest":"With what sad words does the Book of Judges end?",
  "ans": " In those days there was no king in Israel: every man did that which was right in his own eyes"
}
]
