[
  {
  "quest":"Who made himself king without David knowing it?",
  "ans":"Adonijah the son of Haggith and David"
  },
  {
  "quest":"What did Bathsheba do under the guidance of Nathan?",
  "ans":"She met with David and reminded him that he had promised to make Solomon king."
  },
  {
  "quest":"Who under David’s instruction was appointed king of Israel?",
  "ans":"Solomon"
  },
  {
  "quest":"Upon hearing this, what did Adonijah do?",
  "ans":"He caught hold on the horns of the altar"
  },
  {
  "quest":"Who did David charge Solomon to put to death?",
  "ans":"Joab and Shimei"
  },
  {
  "quest":"How many years did David reign as king?",
  "ans":"Forty"
  },
  {
  "quest":"For what request was Adonijah put to death?",
  "ans":"He requested Abishag the Shunammite be given to him as a wife"
  },
  {
  "quest":"Who killed Joab and was put over Solomon’s army?",
  "ans":"Benaiah"
  },
  {
  "quest":"Who was put in the priesthood as a replacement for Abiathar?",
  "ans":"Zadok"
  },
  {
  "quest":"Who else did Benaiah kill?",
  "ans":"Shimei"
  },{
  "quest":"Who did Solomon marry?",
  "ans":"he daughter of Pharaoh king of Egypt"
  },
  {
  "quest":"What opportunity was given to Solomon when the Lord appeared to him?",
  "ans":"To ask of the Lord what he wanted"
  },
  {
  "quest":"For what did Solomon ask?",
  "ans":"An understanding heart to judge God’s people and to discern between good and bad"
  },
  {
  "quest":"In addition to Solomon’s request, what else did the Lord say would be given to him?",
  "ans":"Riches, and honor"
  },
  {
  "quest":"What incident demonstrated the wisdom that God gave Solomon?",
  "ans":"He determined which of the women was the mother of the child"
  },
  {
  "quest":"Who supplied provisions for Solomon?",
  "ans":"Twelve officers over all Israel, each man his month in a year made provision"
  },
  {
  "quest":"How did Solomon’s wisdom compare to others? ",
  "ans":"Solomon's wisdom excelled the wisdom of all the children of the east country, and all the wisdom of Egypt. For he was wiser than all men"
  },
  {
  "quest":"How many proverbs and songs did Solomon speak?",
  "ans":"Three thousand proverbs: and his songs were a thousand and five"
  },
  {
  "quest":"Of what other subjects did Solomon speak?",
  "ans":"Trees, beasts, fowl, creeping things, and of fishes."
  },
  {
  "quest":"From where did people come to hear Solomon’s wisdom?",
  "ans":"From all kings of the earth"
  },{
  "quest":"What did Solomon request from Hiram, king of Tyre?",
  "ans":"Timber from cedar trees"
  },
  {
  "quest":"What was Solomon to do for Hiram?",
  "ans":"Give to Hiram twenty thousand measures of wheat and twenty measures of pure oil each year"
  },
  {
  "quest":"How many Israelites did Solomon use to prepare materials for the temple?",
  "ans":"30,000 to work in Lebanon, 70,000 to bare burdens, 80,000 hewers in the mountains, and 3,300 supervisors."
  },
  {
  "quest":"How many years after Israel left Egypt did Solomon begin to build the temple?",
  "ans":"480"
  },
  {
  "quest":"What were the dimensions of the temple?",
  "ans":"Length 60 cubits, breadth 20 cubits, height 30 cubits"
  },
  {
  "quest":"What was built around the temple?",
  "ans":"Chambers"
  },
  {
  "quest":"What sound was not heard in the temple during the construction?",
  "ans":"The sound of neither hammer nor ax nor any tool of iron"
  },
  {
  "quest":"What did the Lord promise Solomon if he kept God’s statutes?",
  "ans":"God would dwell among the children of Israel, and not forsake them"
  },
  {
  "quest":"Of what material was the inside of the temple overlaid?",
  "ans":"Pure gold  "
  },
  {
  "quest":"How many years did it take to build the temple?",
  "ans":"Seven"
  },{
  "quest":"How many years did it take to build Solomon’s house?",
  "ans":"Thirteen"
  },
  {
  "quest":"Who did the metal work for the temple?",
  "ans":"Hiram out of Tyre, who was a widow's son of the tribe of Naphtali, and his father was a man of Tyre, a worker in brass"
  },
  {
  "quest":"What did Solomon bring to the temple when it was finished?",
  "ans":"The things which David had dedicated; even the silver, the gold, and the vessels"
  },
  {
  "quest":"What did the priests bring to the temple? ",
  "ans":"The ark of the LORD, the tabernacle of the congregation, and all the holy vessels that were in the tabernacle"
  },
  {
  "quest":"What filled the temple when the priests came out of the holy place?",
  "ans":"The glory of the LORD"
  },
  {
  "quest":"What could not contain God?",
  "ans":"The heaven and heaven of heavens and much less the temple"
  },
  {
  "quest":"What did Solomon request of the Lord when people prayed toward the temple?",
  "ans":" To hear from heaven and forgive"
  },
  {
  "quest":"What did Solomon want all the peoples of the earth to know? ",
  "ans":"That the LORD is God, and that there is none else"
  },
  {
  "quest":"How many animals did Solomon offer at the dedication of the temple?",
  "ans":"22,00 oxen, and 120,000 sheep"
  },
  {
  "quest":"What did Solomon build at Ezion-Geber?",
  "ans":"A navy of ships"
  },{
  "quest":"Whose sailors served in the same fleet with Solomon’s men?",
  "ans":"Hiram’s  shipmen that had knowledge of the sea"
  },
  {
  "quest":"What did the Queen of Sheba say when she saw the achievements and wisdom of Solomon?",
  "ans":"The half was not told me: your wisdom and prosperity exceeds the fame which I heard"
  },
  {
  "quest":"How much gold did Solomon receive each year?",
  "ans":"666 talents of gold"
  },
  {
  "quest":"Of what materials did Solomon make his throne?",
  "ans":"Ivory overlaid with the best gold"
  },
  {
  "quest":"Why weren’t any of Solomon’s vessels made of silver? ",
  "ans":"Silver wasn’t worth much because Solomon made silver to be in Jerusalem as stones"
  },
  {
  "quest":"How did the riches and wisdom of Solomon compare to other kings?",
  "ans":"Solomon exceeded all the kings of the earth for riches and for wisdom."
  },
  {
  "quest":"How many chariots and horsemen did Solomon have?",
  "ans":"1,400 chariots and 12,000 horsemen"
  },
  {
  "quest":"How many wives and concubines did Solomon have?",
  "ans":"Seven hundred wives, princesses, and three hundred concubines"
  },
  {
  "quest":"Why was the LORD angry with Solomon?",
  "ans":"Because his heart was turned from the LORD and built high places, burnt incense and sacrificed to the gods of his strange wives"
  },
  {
  "quest":"What did the LORD say would happen to the kingdom?",
  "ans":"God would rend the kingdom from Solomon, and will give it to his servant"
  },{
  "quest":"Who were Solomon’s adversaries?",
  "ans":"Hadad the Edomite and Rezon the son of Eliadah"
  },
  {
  "quest":"With what object did Ahijah the prophet illustrate to Jeroboam that he would become king of ten tribes?",
  "ans":"By tearing Jeroboam’s new garment in twelve pieces and giving him ten"
  },
  {
  "quest":"When would this division of the kingdom occur?",
  "ans":"After Solomon’s son began to reign"
  },
  {
  "quest":"Who tried to kill Jeroboam?",
  "ans":"Solomon"
  },
  {
  "quest":"How long did Solomon reign in Jerusalem? ",
  "ans":"Forty years"
  },
  {
  "quest":"Who reigned as king after Solomon died?",
  "ans":"Rehoboam his son"
  },
  {
  "quest":"What did Jeroboam request of Rehoboam?",
  "ans":"Make the grievous service of Solomon, and his heavy yoke which he put on us, lighter, and we will serve you"
  },
  {
  "quest":"Whose advice did Rehoboam reject?",
  "ans":"The old men"
  },
  {
  "quest":"What advice did Rehoboam follow?",
  "ans":"The advice of the young men who advised him to add to the yoke and chastise with scorpions rather than whips"
  },
  {
  "quest":"What did Israel do to Adoniram, who was over Solomon’s laborers?",
  "ans":"They  stoned him with stones"
  },{
    "quest":"Who did Israel make as their king?",
    "ans":"Jeroboam"
    },
    {
    "quest":"Why did Jeroboam set up golden calves at Bethel and Dan?",
    "ans":"Because he was afraid if the people went to Jerusalem to worship they might turn again to Rehoboam and kill him"
    },
    {
    "quest":"What did the man of God from Judah prophesy against Jeroboam’s altar?",
    "ans":"A child would be born to the house of David, Josiah by name; and on the altar he would offer the priests of the high places that burn incense on it, and men's bones shall be burnt on it. Also, the altar would be rent, and the ashes would be poured out"
    },
    {
    "quest":"What happened to Jeroboam when he ordered the man of God to be seized?",
    "ans":"His hand, which he put forth against him, dried up"
    },
    {
    "quest":"Why did the man of God refuse Jeroboam’s invitation?",
    "ans":"Because God had told him to eat no bread, nor drink water, nor turn again by the same way that you came"
    },{
      "quest":"How did the old prophet at Bethel persuade the man of God to come to his house?",
      "ans":" Because he said he was a prophet also; and claimed an angel spoke to him, saying, to bring him back to his house to eat bread and drink water. But he lied to him"
      },
      {
      "quest":"What happened to the man of God?",
      "ans":"A lion met him on his way home and slew him"
      },
      {
      "quest":"What was the sin of the house of Jeroboam that led to its downfall? ",
      "ans":"He made of the lowest of the people priests of the high places"
      },
      {
      "quest":"What did Jeroboam tell his wife to do?",
      "ans":"Disguise herrself, and go to Ahijah the prophet, and find out what would become of their sick child."
      },
      {
      "quest":"What did the Lord reveal to the prophet Ahijah?",
      "ans":"That Jeroboam’s wife would be coming and to tell her that God would bring evil on the house of Jeroboam and that the child would die."
      },{
        "quest":"What would happen to Israel?",
        "ans":"Israel would be smitten and scattered"
        },
        {
        "quest":"How corrupt did Judah become? ",
        "ans":"They built high places, images, and groves, allowed sodomites in the land: and they did according to all the abominations of the nations which the LORD cast out before the children of Israel"
        },
        {
        "quest":"What did Shishak king of Egypt do?",
        "ans":"He took away the treasures of the house of the LORD the treasures of the king's house, and he took away all the shields of gold which Solomon had made"
        },
        {
        "quest":"What did Rehoboam substitute for the treasures that were taken from the temple?",
        "ans":" Brass shields"
        },
        {
        "quest":"What can be said of Abijah’s three year reign as king of Judah?",
        "ans":"He walked in all the sins of his father, which he had done before him: and his heart was not perfect"
        },{
          "quest":"How did Asa do in his forty-one year reign over Judah?",
          "ans":"Asa did that which was right in the eyes of the LORD.  He took away the sodomites and removed all the idols that his fathers had made"
          },
          {
          "quest":"How did Nadab do in his two year reign over Israel? ",
          "ans":"He did evil in the sight of the LORD"
          },
          {
          "quest":"How did Baasha become king of Israel?",
          "ans":"Baasha slew Asa, and reigned in his stead"
          },
          {
          "quest":"What can be said of Baasha’s twenty-four year reign as king of Israel? ",
          "ans":"He smote all the house of Jeroboam according to Ahijah’s prophecy but he still did evil in the sight of the LORD, and walked in the way of Jeroboam"
          },
{
"quest":"Who prophesied against Baasha?",
"ans":"Jehu the son of Hanani"
},
{
  "quest":"How did Zimri become king?",
  "ans":"Zimri went in and smote Elah the son of Baasha, and killed him and reigned in his stead"
  },
  {
    "quest":"How many days did Zimri reign as king of Israel?",
    "ans":"Seven"
    },
    {
      "quest":"How did Omri do in his twelve year reign as king over Israel? ",
      "ans":"Omri worked evil in the eyes of the LORD, and did worse than all that were before him"
      },
      {
        "quest":"What city did Omri build?",
        "ans":"Samaria"
        },
        {
          "quest":"How did Ahab do in his twenty-two year reign over Israel?",
          "ans":" Ahab the son of Omri did evil in the sight of the LORD above all that were before him"
          },
          {
            "quest":"Who did Ahab marry?",
            "ans":"Jezebel the daughter of Ethbaal king of the Zidonians"
            },
            {
              "quest":"How was Joshua’s prophecy fulfilled when Jericho was rebuilt?",
              "ans":"It appears that two of his sons died as was prophesied"
              },
              {
                "quest":"What did Elijah tell would not happen for the next three years?",
                "ans":"Dew or rain"
                },
  {
    "quest":"How was Elijah fed during this time?",
    "ans":"Ravens fed him"
  },
  {
    "quest":"What did Elijah ask the widow of Zarephath to do for him?",
    "ans":"Bring him a little water in a vessel and a morsel of bread"
  },
  {
    "quest":"What miracle of provision did the LORD perform for the widow?",
    "ans":"The barrel of meal did not waste, neither did the cruse of oil fail, until the day that the LORD sent rain on the earth."
  },
  {
    "quest":"What other miracle did the LORD perform for the widow?",
    "ans":"Raised the woman’s son from the dead."
  },
  {
    "quest":"What did the LORD tell Elijah to do?",
    "ans":" Show himself to Ahab"
  },
  {
    "quest":"What did Obadiah do when Jezebel was killing the LORD’s prophets?",
    "ans":"He took an hundred prophets, and hid them by fifty in a cave, and fed them with bread and water"
  },
  {
    "quest":"Why was Obadiah afraid to tell Ahab that Elijah was there?",
    "ans":"He was afraid that the Spirit of the LORD would carry Elijah somewhere and when he told Ahab, and Ahab could not find Elijah that Ahab would kill him"
  },
  {
    "quest":"What did Ahab call Elijah?",
    "ans":"He that troubles Israel"
  },
  {
    "quest":"How many false prophets came up against Elijah on Mt. Carmel? ",
    "ans":"850 to 1"
  },
  {
    "quest":"What did Elijah ask the people of Israel?",
    "ans":"How long halt you between two opinions? if the LORD be God, follow him: but if Baal, then follow him."
  },
  {
    "quest":"What would be the sign of the one true God?",
    "ans":"The God that answers by fire"
  },
  {
    "quest":"How long did Elijah give the prophets of Baal to call on their god?",
    "ans":"From morning until the time of the evening sacrifice"
  },
  {
    "quest":"How much water did Elijah pour on his sacrifice and wood?",
    "ans":"Twelve barrels"
  },
  {
    "quest":"Why did Elijah want God to answer his prayer? ",
    "ans":"For it to be known that The LORD is God in Israel, and that he was God’s servant, and that he did all these things at God’s word"
  },
  {
    "quest":"What did they do to the prophets of Baal?",
    "ans":"Slew them"
  },
  {
    "quest":"What did Elijah hear?",
    "ans":" A sound of abundance of rain"
  },
  {
    "quest":"What sign was given to Elijah’s servant that it was going to rain?",
    "ans":"A little cloud out of the sea, like a man's hand"
  },
  {
    "quest":"How fast did Elijah run?",
    "ans":"Faster than Ahab rode"
  },
  {
    "quest":"Why did Elijah flee from Jezebel? ",
    "ans":"She was wanting to kill him for killing her prophets"
  },
  {
    "quest":"For what did Elijah pray?",
    "ans":"That he might die"
  },
  {
    "quest":"Who provided food for Elijah giving him strength to get to Horeb?",
    "ans":"An angel of the LORD"
  },
  {
    "quest":"What question did the LORD twice ask Elijah?",
    "ans":"What do you here, Elijah?"
  },
  {
    "quest":"How did the LORD speak to Elijah?",
    "ans":"With a still small voice"
  },
  {
    "quest":"How did the LORD respond to Elijah’s statement that he was the only one left of the LORD’s prophets?",
    "ans":"I have left me seven thousand in Israel, all the knees which have not bowed to Baal"
  },
  {
    "quest":"Who did the LORD tell Elijah to anoint?",
    "ans":"Hazael to be king over Syria: Jehu to be king over Israel: and Elisha to be prophet in Elijah’s place"
  },
  {
    "quest":"What was Elisha doing when Elijah found him?",
    "ans":"Plowing with twelve yoke of oxen before him"
  },
  {
    "quest":"What did Elisha do to his yoke of oxen and plowing equipment?",
    "ans":"He took a yoke of oxen, slew them, and boiled their flesh with the instruments of the oxen, and gave to the people to eat."
  },
  {
    "quest":"Who threatened to take Ahab’s wives, children, silver and gold?",
    "ans":"Benhadad the king of Syria"
  },
  {
    "quest":"Why did the LORD give Ahab victory over Ben-Hadad?",
    "ans":"Because the Syrians said, The LORD is God of the hills, but he is not God of the valleys, therefore God delivered them that they would know who was the LORD"
  },
  {
    "quest":"For what did the prophet condemn Ahab?",
    "ans":"Because he let Benhadad go whom God appointed to utter destruction"
  },
  {
    "quest":"Why did Naboth refuse to sell Ahab his vineyard?",
    "ans":"Because he believed that the LORD forbid him from giving his inheritance to Ahab"
  },
  {
    "quest":"What did Jezebel have done to Naboth?",
    "ans":"She had false witnesses accuse Naboth of blaspheming and then had him stoned to death."
  },
  {
    "quest":"What did Elijah prophesy about Ahab?",
    "ans":"In the place where dogs licked the blood of Naboth shall dogs lick Ahab’s blood"
  },
  {
    "quest":"What did Elijah prophesy would happen to Jezebel?",
    "ans":"The dogs would eat Jezebel by the wall of Jezreel"
  },
  {
    "quest":"Who was partly responsible for Ahab’s vile behavior?",
    "ans":"Jezebel"
  },
  {
    "quest":"Why was the disaster prophesied against Ahab delayed until his son? ",
    "ans":"Because he humbled himself before God"
  },
  {
    "quest":"What did Ahab ask Jehoshaphat to do?",
    "ans":"To go with Ahab to battle to Ramothgilead"
  },
  {
    "quest":"What did Jehoshaphat first want to do?",
    "ans":"Inquire at the word of the LORD"
  },
  {
    "quest":"What did Ahab’s four hundred prophets tell Ahab to do?",
    "ans":"Go up against Ramothgilead to battle; for the LORD shall deliver it into the hand of the king"
  },
  {
    "quest":"Why did Ahab hate Micaiah?",
    "ans":"Because he did not prophesy good concerning Ahab, but evil."
  },
  {
    "quest":"What did Micaiah say would happen to Israel?",
    "ans":" Israel would be scattered on the hills, as sheep that have not a shepherd"
  },
  {
    "quest":"What did Ahab order to be done to Micaiah?",
    "ans":"Put him in prison, and feed him with bread and water of affliction"
  },
  {
    "quest":"What happened to Ahab in the battle?",
    "ans":"He was smitten with an arrow and he died"
  },
  {
    "quest":"What did Jehoshaphat get rid of out of the land of Judah",
    "ans":"Sodomites"
  },
  {
    "quest":"What happened to Jehoshaphat’s ships? ",
    "ans":"They were broken at Eziongeber"
  },
  {
    "quest":"How did Ahaziah do in his two year reign over Israel?",
    "ans":"He did evil in the sight of the LORD, and walked in the way of his parents Ahab and Jezebel"
  }
  ]
