[
  {
  "quest":"During what period did the story of Ruth occur? (1)",
  "ans": "In the days when the judges ruled"
},
{
  "quest":"Who went to Moab? (2)",
  "ans": "Elimelech, his wife Naomi, and the name of his two sons Mahlon and Chilion"
},
{
  "quest":"Who was the first to die in Moab? (3)",
  "ans": "Elimelech"
},
{
  "quest":"Who did Naomi’s sons marry? (4)",
  "ans": "Orphah and Ruth"
},
{
  "quest":"What happened to these sons? (5)",
  "ans": "They died"
},
{
  "quest":"Why did Naomi decide to return from the country of Moab? (6)",
  "ans": "She heard in the country of Moab that the LORD had visited his people in giving them bread."
},
{
  "quest":"Why did Naomi encourage her daughters-in-law to stay in Moab? (11-13)",
  "ans": "She felt they had a better chance to find a husband in Moab"
},
{
  "quest":"Who went back to her people? (14)",
  "ans": "Orphah"
},
{
  "quest":"How did Ruth reply? (16-17)",
  "ans": "Entreat me not to leave you, or to return from following after you: for where you go, I will go; and where you lodge, I will lodge: your people shall be my people, and your God my God"
},
{
  "quest":"Why did Naomi want to be called Mara? (20)",
  "ans": "Because she felt the Almighty has dealt very bitterly with her."
},
{
  "quest":"At what season did Ruth and Naomi return to Bethlehem? (22)",
  "ans": "In the beginning of barley harvest."
},
{
  "quest":"To who was Boaz related? (1)",
  "ans": "Elimelech"
},
{
  "quest":"What did Ruth do in the field of Boaz? (2-3)",
  "ans": "Gleaned"
},
{
  "quest":"What did Boaz ask Ruth to do? (8-9)",
  "ans": "Glean in his field, and abide with his maidens"
},
{
  "quest":"What had Boaz heard about Ruth? (11)",
  "ans": "All that she had done for her mother in law since the death of her husband"
},
{
  "quest":"What did Boaz tell his young men to do? (15-16)",
  "ans": "Let Ruth glean even among the sheaves, and reproach her not: And let fall also some of the handfuls of purpose for her, and rebuke her not"
},
{
  "quest":"How long was Ruth allowed to glean in the field of Boaz? (23)",
  "ans": "To the end of barley harvest and of wheat harvest"
},
{
  "quest":"Where did Ruth lie down after Boaz fell asleep? (4-7)",
  "ans": "At the feet of Boaz"
},
{
  "quest":"What did Ruth bring to Naomi? (15-17)",
  "ans": "Six measures of barley   "
},
{
  "quest":"What was the method of confirming a transfer of property? (7-8)",
  "ans": "A man plucked off his shoe, and gave it to his neighbor"
},
{
  "quest":"What did Boaz buy and acquire? (9-10)",
  "ans": "All that was Elimelech's, and all that was Chilion's and Mahlon's, and Ruth to be his wife"
},
{
  "quest":"Who was Ruth’s great-grandson? (21-22)",
  "ans": "David"
}

]
