[
{
  "quest":"What did a man from Saul’s camp bring to David? (10)",
  "ans": "Saul’s crown  and bracelet"
},
{
  "quest":"What did David have done to the Amalekite who claimed to have killed Saul? (13-15)",
  "ans": "Had a young man fall on him and  smite him dead"
},
{
  "quest":"What did David say about the mighty? (19,25,27)",
  "ans": "How are the mighty fallen!"
},
{
  "quest":"What did the men of Judah do to David at Hebron? (4)",
  "ans": "They anointed David king over the house of Judah."
},
{
  "quest":"Who did Abner make as king over Israel? (8-10)",
  "ans": "Ishbosheth the son of Saul"
},
{
  "quest":"How long was David king over just Judah? (11)",
  "ans": "Seven years and six months"
},
{
  "quest":"Who pursued after Abner and was killed by Abner? (19-23)",
  "ans": "Asahel"
},
{
  "quest":"What eventually happened as the war between the house of Saul and the house of David continued? (1)",
  "ans": "David waxed stronger and stronger, and the house of Saul waxed weaker and weaker"
},
{
  "quest":"What did Abner decide to do regarding the kingdom of Israel? (9-12)",
  "ans": "Translate the kingdom from the house of Saul, and to set up the throne of David over Israel and over Judah"
},
{
  "quest":"What did David ask Abner to bring with him? (13)",
  "ans": "Michal, Saul's daughter"
},
{
  "quest":"Who killed Abner without David’s permission? (26-27)",
  "ans": "Joab"
},
{
  "quest":"What did Recab and Baanah do to Ishbosheth, son of Saul? (5-8)",
  "ans": "They smote him and beheaded him, and brought the head of Ishbosheth to David"
},
{
  "quest":"What did David’s men do to Recab and Baanah? (12)",
  "ans": "They slew them, cut off their hands and their feet, and hanged them up over the pool in Hebron"
},
{
  "quest":"What did the elders of Israel do to David? (3)",
  "ans": "They anointed David king over Israel"
},
{
  "quest":"How old was David when he became king of Judah? (4)",
  "ans": "Thirty years old"
},
{
  "quest":"What city did David conquer and call the City of David? (7)",
  "ans": "Zion"
},
{
  "quest":"What did Hiram, king of Tyre, do for David? (11)",
  "ans": "Sent messengers to David, and cedar trees, and carpenters, and masons: and they built David an house"
},
{
  "quest":"Who did David defeat twice? (17-25)",
  "ans": "The Philistines  "
},
{
  "quest":"What happened to Uzzah? (6-7)",
  "ans": "Because Uzzah put forth his hand to the ark of God,  God smote him and he died by the ark of God"
},
{
  "quest":"At whose house did the ark remain for three months? (11)",
  "ans": "Obededom"
},
{
  "quest":"What did David do when he brought the ark to the City of David? (14-15)",
  "ans": "David danced before the LORD with all his might"
},
{
  "quest":"What was Michal’s reaction to David’s dancing before the Lord? (16,20)",
  "ans": "She despised him in her heart"
},
{
  "quest":"What happened to Michal? (23)",
  "ans": "She became barren"
}
]
