[
{
  "quest":"What did a man from Saul’s camp bring to David? (10)",
  "ans": "Saul’s crown  and bracelet"
},
{
  "quest":"What did David have done to the Amalekite who claimed to have killed Saul? (13-15)",
  "ans": "Had a young man fall on him and  smite him dead"
},
{
  "quest":"What did David say about the mighty? (19,25,27)",
  "ans": "How are the mighty fallen!"
},
{
  "quest":"What did the men of Judah do to David at Hebron? (4)",
  "ans": "They anointed David king over the house of Judah."
},
{
  "quest":"Who did Abner make as king over Israel? (8-10)",
  "ans": "Ishbosheth the son of Saul"
},
{
  "quest":"How long was David king over just Judah? (11)",
  "ans": "Seven years and six months"
},
{
  "quest":"Who pursued after Abner and was killed by Abner? (19-23)",
  "ans": "Asahel"
},
{
  "quest":"What eventually happened as the war between the house of Saul and the house of David continued? (1)",
  "ans": "David waxed stronger and stronger, and the house of Saul waxed weaker and weaker"
},
{
  "quest":"What did Abner decide to do regarding the kingdom of Israel? (9-12)",
  "ans": "Translate the kingdom from the house of Saul, and to set up the throne of David over Israel and over Judah"
},
{
  "quest":"What did David ask Abner to bring with him? (13)",
  "ans": "Michal, Saul's daughter"
},
{
  "quest":"Who killed Abner without David’s permission? (26-27)",
  "ans": "Joab"
},
{
  "quest":"What did Recab and Baanah do to Ishbosheth, son of Saul? (5-8)",
  "ans": "They smote him and beheaded him, and brought the head of Ishbosheth to David"
},
{
  "quest":"What did David’s men do to Recab and Baanah? (12)",
  "ans": "They slew them, cut off their hands and their feet, and hanged them up over the pool in Hebron"
},
{
  "quest":"What did the elders of Israel do to David? (3)",
  "ans": "They anointed David king over Israel"
},
{
  "quest":"How old was David when he became king of Judah? (4)",
  "ans": "Thirty years old"
},
{
  "quest":"What city did David conquer and call the City of David? (7)",
  "ans": "Zion"
},
{
  "quest":"What did Hiram, king of Tyre, do for David? (11)",
  "ans": "Sent messengers to David, and cedar trees, and carpenters, and masons: and they built David an house"
},
{
  "quest":"Who did David defeat twice? (17-25)",
  "ans": "The Philistines  "
},
{
  "quest":"What happened to Uzzah? (6-7)",
  "ans": "Because Uzzah put forth his hand to the ark of God,  God smote him and he died by the ark of God"
},
{
  "quest":"At whose house did the ark remain for three months? (11)",
  "ans": "Obededom"
},
{
  "quest":"What did David do when he brought the ark to the City of David? (14-15)",
  "ans": "David danced before the LORD with all his might"
},
{
  "quest":"What was Michal’s reaction to David’s dancing before the Lord? (16,20)",
  "ans": "She despised him in her heart"
},
{
  "quest":"What happened to Michal? (23)",
  "ans": "She became barren"
},
{
  "quest":"Instead of David who would build a house for God’s name? (12-13)",
  "ans": "His seed after him"
},{
  "quest":"How long would David’s kingdom endure? (13-16)",
  "ans": "For ever"
},{
  "quest":"What did David do to the chariot horses that belonged to the king of Zobah? (3-4)",
  "ans": "Hamstrung them"
},{
  "quest":"What did David do with the silver, gold, and brass that were brought to him? (7-11)",
  "ans": "Dedicated it to the LORD"
},{
  "quest":"Who was over David’s army? (16)",
  "ans": "Joab"
},{
  "quest":"Who were David’s priests? (17",
  "ans": "Zadok the son of Ahitub, and Ahimelech the son of Abiathar"
},
{
  "quest":"To whom of the house of Saul did David show kindness? (3-6)",
  "ans": "Mephibosheth"
},{
  "quest":"What benefits did David provide for him? (7-13)",
  "ans": "Eat at David’s table, as one of the king's sons"
},{
  "quest":"What did Hanun do to David’s men? (4)",
  "ans": "Shaved off  one half of their beards, cut off their garments in the middle, even to their buttocks, and sent them away"
},{
  "quest":"What was the battle plan of Joab and Abishai? (9-11)",
  "ans": "Part of the army was under Joab and part under Abishai.  When one needed help the other would come"
},{
  "quest":"At the time when kings go to war where was David? (1)  ",
  "ans": "David tarried still at Jerusalem saw a woman washing herself"
},{
  "quest":"What resulted from David’s affair with Bathsheba? (5)",
  "ans": "Bathseba became pregnant"
},{
  "quest":"How did David attempt to cover up this sin? ",
  "ans": "Brought home her husband and tried to get him to go in to his wife"
},{
  "quest":"How did David have Uriah put to death?",
  "ans": "He had Joab put him in the hottest part of the battle so he would be smitten and die"
},{
  "quest":"What did David then do with Bathsheba?",
  "ans": "Married her"
},{
  "quest":"How did Nathan cause David to recognize his sin?",
  "ans": "Telling a story of a rich man who killed a poor man’s lamb"
},{
  "quest":"What would not depart from David’s house?",
  "ans": " The sword"
},{
  "quest":"What did David do after Nathan spoke to him? ",
  "ans": "He said “I have sinned against the LORD”"
},{
  "quest":"What opportunity did David give to the enemies of the Lord?",
  "ans": "To blaspheme"
},{
  "quest":"What happened to the child that Uriah’s wife bore to David?",
  "ans": "The child died"
},{
  "quest":"How did David respond upon hearing of the death of the child?",
  "ans": "David arose from the earth, and washed, and anointed himself, and changed his apparel, and came into the house of the LORD, and worshipped"
},{
  "quest":"How did David explain his behavior?",
  "ans": "While the child was yet alive, I fasted and wept: 23But now he is dead, why should I fast? can I bring him back again?"
},{
  "quest":"Who afterwards was born to David and Bathsheba?",
  "ans": "Solomon"
},{
  "quest":"What did David take from the head from the king of Rabah?",
  "ans": "The king's crown"
},{
  "quest":"What did Amnon the son of David do to Tamar the sister of Absalom?",
  "ans": "He raped her"
},{
  "quest":"After the sin what did Amnon do to Tamar?",
  "ans": "He hated her"
},{
  "quest":"What did Absalom have his servants do to Amnon?",
  "ans": "He had his servants kill him"
},{
  "quest":"To where did Absalom flee? ",
  "ans": "To Talmai, the son of Ammihud, king of Geshur"
},{
  "quest":"Who did Joab use to tell David a story so that Absalom would be brought back?",
  "ans": "A wise woman of Tekoah"
},{
  "quest":"Where did David want Absalom to go?",
  "ans": "To his own house"
},{
  "quest":"How long did Absalom live in Jerusalem without seeing David?",
  "ans": "Two years"
},{
  "quest":"How did Absalom finally get to see David?",
  "ans": "He had his servants set Joab’s field on fire"
},{
  "quest":"How did Absalom steal the hearts of Israel?",
  "ans": " He  made it publicly known that he wished to be judge of the land. Also when any man came near to him, he put forth his hand, and took him, and kissed him."
},{
  "quest":"What did Absalom appoint himself to be at Hebron?",
  "ans": "The one who reigns"
},{
  "quest":"Who did Absalom send for?",
  "ans": "Ahithophel, David’s counselor"
},{
  "quest":"When David fled Jerusalem who remained at Jerusalem to inform him?",
  "ans": "Zadok the priest, his son Ahimaaz, Abiathar and his son Jonathan"
},{
  "quest":"Who else did David send to Jerusalem to frustrate Ahithophel’s advice?",
  "ans": "Hushai"
},{
  "quest":"What did Ziba do for David?",
  "ans": "Brought him two hundred loaves of bread, and an hundred bunches of raisins, and an hundred of summer fruits, and a bottle of wine"
},{
  "quest":"What did Shimei do to David?",
  "ans": "Cast stones at David and cursed him"
},{
  "quest":"Whose prophecy did Absalom fulfill?",
  "ans": "Nathan"
},{
  "quest":"How did Absalom regard Ahithophel’s advice?",
  "ans": "As if a man had inquired at the oracle of God"
},{
  "quest":"Whose advice, regarding pursuing David, did Absalom think was better than that of Ahithophel?",
  "ans": "Hushai"
},{
  "quest":"Who did Hushai tell and send to David?",
  "ans": "He told Zadok and to Abiathar the priests, who sent their sons Ahimaaz and Jonathan to David"
},{
  "quest":"How did Jonathan and Ahimaaz hide?",
  "ans": " In a well"
},{
  "quest":"What did Ahithophel do when he saw his advice was not followed?",
  "ans": "He hanged himself"
},{
  "quest":"Who did Absalom appoint over his army?",
  "ans": "Amasa"
},{
  "quest":"What did Shobi, Makir, and Barzillai do for David?",
  "ans": "Brought beds, and basins, earthen vessels, wheat, barley, flour, parched corn, beans, lentils, parched vegetables, honey, butter, sheep, and cheese"
},{
  "quest":"What command did David give his army regarding Absalom?",
  "ans": "Deal gently for my sake with Absalom."
},
{
  "quest":"What happened to Absalom in the forest?",
  "ans": "His head got caught in a tree and the mule he was riding on went away."
},{
  "quest":"What did Joab do to Absalom?",
  "ans": " He took three darts, and thrust them through the heart of Absalom,"
},{
  "quest":"Who ran to David but had no news concerning Absalom?",
  "ans": "Ahimaaz"
},{
  "quest":"Who brought the news concerning Absalom’s death to David?",
  "ans": "Cushi"
},{
  "quest":"Why did Joab tell David to stop mourning for Absalom?",
  "ans": "If David did not quit mourning no one would continue to follow him"
},{
  "quest":"Who did David refuse to kill when he returned to Jerusalem?",
  "ans": "Shemei"
},{
  "quest":"Why did Barzillai turn down David’s offer to go to Jerusalem?",
  "ans": "He was old and did not want to be a burden to the king."
},{
  "quest":"Who rebelled against David?",
  "ans": "Sheba, the son of Bichri"
},{
  "quest":"Who did Joab kill that could have become commander of the army?",
  "ans": "Amasa"
},{
  "quest":"What did the wise woman do to spare the city which Joab was seeking to destroy?",
  "ans": "She arranged to have the head of Sheba cut off and thrown over the wall to Joab"
},{
  "quest":"Who was hanged and exposed by the Gibeonites?",
  "ans": "Seven male descendants of Saul"
},{
  "quest":"What did Rizpah do? ",
  "ans": "She did not allow either the birds of the air to rest on the bodies by day, nor the beasts of the field by night."
},{
  "quest":"What was unusual about the man that Jonathan son of Shimeah killed?",
  "ans": "He was a man of great stature, that had on every hand six fingers, and on every foot six toes"
},{
  "quest":"To whom did David sing?",
  "ans": "The Lord"
},{
  "quest":"Who smote the Philistines until his hand grew tired and froze to the sword?",
  "ans": "Eleazar"
},{
  "quest":"Who stood in the middle of a field of lentils and defended it?",
  "ans": "Shammah"
},{
  "quest":"What did David do with the water that was brought from Bethlehem?",
  "ans": "He poured it out to the LORD"
},{
  "quest":"Who went down into a pit and slew a lion on a snowy day?",
  "ans": "Benaiah"
},{
  "quest":"Who was the last person mentioned among David’s mighty men?",
  "ans": "Uriah the Hittite"
},{
  "quest":"What did David command Joab to do?",
  "ans": "Number the people"
},{
  "quest":"What did David realize he had done?",
  "ans": "He had sinned greatly"
},{
  "quest":"What three options did Gad offer David as punishment? ",
  "ans": "Seven years of famine, flee three months before his enemies, or three days' pestilence"
},{
  "quest":"What did Araunah offer to give to David?",
  "ans": "Oxen for burnt sacrifice and wood"
},{
  "quest":"Why did David insist on paying?",
  "ans": "He would not offer burnt offerings to the LORD of that which cost him nothing"
}
]
